src/cf/InformationRegisters/SynchronizationCircuit.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>SynchronizationCircuit</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>NodeName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>125</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PeerInfobaseNodeName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>125</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsSyncDeleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LatestUpdate</Name>
					<Comment>Время по Гринвичу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Looping</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>ACC:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NodeCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CorrespondentNodeCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CommonInfobasesNodesSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>CommonInfobasesNodesSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AdjustMappingData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InitialDataExport</Name>
					<Comment>Flag for initial data upload</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeleteUserForDataSync</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExecuteDataSending</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SettingCompleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InitialImageCreated</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MessageForDataMapping</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CorrespondentVersion</Name>
					<Comment>The version of the configuration information of the base-correspondent</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsLoopDetected</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeDataRegistrationOnLoop</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DisableSynchronizationCircuitMonitoring</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseScenariosInSaaS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseConnectionsSettingsInSaaS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SynchronizationIsUnavailable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CorrespondentExchangePlanName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>SentNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SentNumberInitialDataExport</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrespondentPrefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MigrationToWebService_Step</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MigrationToWebService_PeerEndpoint</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MessagesQueueEndpoint</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MigrationToWebService_Endpoint</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MessagesQueueEndpoint</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MigrationToWebService_DataArea</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ObjectsUnregisteredDuringLoop.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ObjectsUnregisteredDuringLoop</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>InformationRegisterName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InformationRegisterChanges</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ObjectPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>ACC:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Comment>ACC:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>InformationRegisterKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/SynchronizationCircuit/Forms/SynchronizationLoop/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Items.InfoLoopDetected.Title = StringFunctions.FormattedString(
		Items.InfoLoopDetected.Title, 
		DataExchangeLoopControl.AllLoopedNodesPresentation());
		
	Query = New Query;
	Query.Text = 
	"SELECT
	|	Settings.InfobaseNode AS InfobaseNode,
	|	Settings.ExchangeDataRegistrationOnLoop AS ExchangeDataRegistrationOnLoop,
	|	Settings.DisableSynchronizationCircuitMonitoring AS DisableSynchronizationCircuitMonitoring
	|FROM
	|	InformationRegister.CommonInfobasesNodesSettings AS Settings
	|WHERE
	|	Settings.IsLoopDetected
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT TOP 1
	|	Settings.InfobaseNode AS InfobaseNode
	|FROM
	|	InformationRegister.CommonInfobasesNodesSettings AS Settings
	|WHERE
	|	Settings.DisableSynchronizationCircuitMonitoring";
	
	QueryResult = Query.ExecuteBatch();
	
	NodeTable_.Load(QueryResult[0].Unload());
	If NodeTable_.Count() > 0 Then
		
		Items.GroupThisInfobase.Visible = True;
		Items.FormSwitchControl.Visible = False;
		Items.GroupAnotherInfobase.Visible = False;
		
	Else
		
		Items.GroupThisInfobase.Visible = False;
		Items.FormSwitchControl.Visible = True;
		Items.GroupAnotherInfobase.Visible = True;
		
		Items.InformationAnotherInfobase.Title = StringFunctions.FormattedString(
			Items.InformationAnotherInfobase.Title,
			DataExchangeLoopControl.InfobaseWithSuspendedRegistrationPresentation());
		
	EndIf;
	
	SynchronizationLoopMonitoringIsEnabled = QueryResult[1].IsEmpty();
	LoopingWarningIsHidden = DataExchangeLoopControl.LoopingWarningIsHiddenFromUser();
	
	SetConditionalAppearance();
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	FormElementHeaders();
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersNodeTable_

&AtClient
Procedure NodeTable_DisableSynchronizationCircuitMonitoringOnChange(Item)
	
	CurrentRowData = Items.NodeTable_.CurrentData;
	If CurrentRowData = Undefined Then
		
		Return;
		
	EndIf;
	
	LoopControlManagement(CurrentRowData.InfobaseNode, CurrentRowData.DisableSynchronizationCircuitMonitoring);
	
EndProcedure

&AtClient
Procedure NodeTable_Selection(Item, RowSelected, Field, StandardProcessing)
	
	If Field.Name = "NodeTable_ExchangeDataRegistrationOnLoop" Then
		
		String = NodeTable_.FindByID(RowSelected);
		String.ExchangeDataRegistrationOnLoop = Not String.ExchangeDataRegistrationOnLoop;
		
		PauseResumeRegistration(String.InfobaseNode, String.ExchangeDataRegistrationOnLoop);
		
	ElsIf Field.Name = "NodeTable_UnregistreredData" Then
		
		String = NodeTable_.FindByID(RowSelected);
		FormParameters = New Structure("InfobaseNode", String.InfobaseNode);
		
		OpenForm("InformationRegister.ObjectsUnregisteredDuringLoop.ListForm", FormParameters);
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure CloseForm(Command)
	
	Notify("ChangingVisibilityOfLoopingWarnings");
	Close();
	
EndProcedure

&AtClient
Procedure SynchronizationCircuit(Command)
	
	OpenForm("InformationRegister.SynchronizationCircuit.ListForm");
	
EndProcedure

&AtClient
Procedure SwitchControl(Command)
	
	SwitchControlAtServer();
	FormElementHeaders();
	
EndProcedure

&AtClient
Procedure DisplayLoopingWarning(Command)
	
	LoopingWarningIsHidden = Not LoopingWarningIsHidden;
	DataExchangeServerCall.HideShowLoopingWarningFromUser(LoopingWarningIsHidden);
	FormElementHeaders();
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure FormElementHeaders()
	
	If SynchronizationLoopMonitoringIsEnabled = True Then
		
		LineHeader = NStr("en = 'Disable control'", CommonClient.DefaultLanguageCode());
		
	Else
		
		LineHeader = NStr("en = 'Enable control'", CommonClient.DefaultLanguageCode());
		
	EndIf;
	
	Items.FormSwitchControl.Title = LineHeader;
	
	
	If LoopingWarningIsHidden = True Then
		
		LineHeader = NStr("en = 'Show synchronization loop warning'", CommonClient.DefaultLanguageCode());
		
	Else
		
		LineHeader = NStr("en = 'Hide synchronization loop warning'", CommonClient.DefaultLanguageCode());
		
	EndIf;
	
	Items.FormDisplayLoopingWarning.Title = LineHeader;
	
EndProcedure

&AtServer
Function SubAssetsWithDetectedLooping()
	
	Query = New Query(
	"SELECT DISTINCT
	|	SynchronizationCircuit.InfobaseNode AS ExchangePlanNode
	|FROM
	|	InformationRegister.SynchronizationCircuit AS SynchronizationCircuit
	|		INNER JOIN InformationRegister.CommonInfobasesNodesSettings AS CommonInfobasesNodesSettings
	|		ON SynchronizationCircuit.InfobaseNode = CommonInfobasesNodesSettings.InfobaseNode
	|WHERE
	|	NOT SynchronizationCircuit.InfobaseNode IS NULL");
	
	Return Query.Execute().Unload().UnloadColumn("ExchangePlanNode");
	
EndFunction

&AtServer
Procedure PauseResumeRegistration(InfobaseNode, ExchangeDataRegistrationOnLoop)
	
	SetPrivilegedMode(True);
	
	Try 
		
		InformationRegisters.CommonInfobasesNodesSettings.SetLoop(
			InfobaseNode,,
			ExchangeDataRegistrationOnLoop);
		
	Except
		
		WriteLogEvent(, EventLogLevel.Error,,, ErrorProcessing.DetailErrorDescription(ErrorInfo()));
		
	EndTry;
	
EndProcedure

&AtServer
Procedure SwitchControlAtServer()
	
	SubAssetsWithDetectedLooping = SubAssetsWithDetectedLooping();
	For Each ExchangePlanNode In SubAssetsWithDetectedLooping Do
		
		InformationRegisters.CommonInfobasesNodesSettings.SetLoop(ExchangePlanNode, , , SynchronizationLoopMonitoringIsEnabled);
		
	EndDo;
	
	SynchronizationLoopMonitoringIsEnabled = Not SynchronizationLoopMonitoringIsEnabled;
	If Not SynchronizationLoopMonitoringIsEnabled Then
		
		DataExchangeServerCall.HideShowLoopingWarningFromUser(True);
		
	EndIf;
	
EndProcedure

&AtServer
Procedure SetConditionalAppearance()
	
	ConditionalAppearance.Items.Clear();
	
	// Resume registration
	Item = ConditionalAppearance.Items.Add();
	
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField("NodeTable_ExchangeDataRegistrationOnLoop");
	
	ItemFilter = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("NodeTable_.ExchangeDataRegistrationOnLoop");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = False;
	
	Text = NStr("en = 'Resume registration'");
	Item.Appearance.SetParameterValue("Text", Text);
	Item.Appearance.SetParameterValue("ReadOnly", True);
	Item.Appearance.SetParameterValue("TextColor", WebColors.Blue);
	
	// Terminate registration
	Item = ConditionalAppearance.Items.Add();
	
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField("NodeTable_ExchangeDataRegistrationOnLoop");
	
	ItemFilter = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("NodeTable_.ExchangeDataRegistrationOnLoop");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = True;
	
	Text = NStr("en = 'Terminate registration'");
	Item.Appearance.SetParameterValue("Text", Text);
	Item.Appearance.SetParameterValue("ReadOnly", True);
	Item.Appearance.SetParameterValue("TextColor", WebColors.Blue);

	// Navigate
	Item = ConditionalAppearance.Items.Add();
	
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField("NodeTable_UnregistreredData");
	
	ItemFilter = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("NodeTable_.InfobaseNode");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Filled;
	
	Text = NStr("en = 'Navigate'");
	Item.Appearance.SetParameterValue("Text", Text);
	Item.Appearance.SetParameterValue("ReadOnly", True);
	Item.Appearance.SetParameterValue("TextColor", WebColors.Blue);
	
EndProcedure

&AtServer
Procedure LoopControlManagement(Val InfobaseNode, Val DisableSynchronizationCircuitMonitoring)
	
	SetPrivilegedMode(True);
	
	Try 
		
		InformationRegisters.CommonInfobasesNodesSettings.SetLoop(
			InfobaseNode,,, DisableSynchronizationCircuitMonitoring);
		
	Except
		
		WriteLogEvent(, EventLogLevel.Error,,, ErrorProcessing.DetailErrorDescription(ErrorInfo()));
		
	EndTry;
	
	
EndProcedure

#EndRegion
